{
  "search_results_0A": "Corporate Governance Committee Mr. A.S. Minocha (Chairman), DIN: 00010490 Mr. G.S. Talwar, DIN: 00559460 Late Rajiv Krishan Luthra, DIN: 00022285* Ms. Priya Paul, DIN: 00051215 * Demised on 10 May 2023.||||||||| |10. Details of Review of NGRBCs by the Company:|Col2|Col3|Col4|Col5|Col6|Col7|Col8|Col9|Col10|Col11|Col12|Col13|Col14|Col15|Col16|Col17|Col18|Col19|Col20| |---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---|---| |Subject for Review|Indicate whether review was undertaken by Director/ Committee of the Board/ Any other Committee||||||||||Frequency (Annually/ Half yearly/ Quarterly/ Any other)||||||||| ||P 1|P 2|P 3|P 4|P 5|P 6|P 7|P 7|P 8|P 9|P 1|P 2|P 3|P 4|P 5|P 6|P 7|P 8|P 9| |Performance against above policies and follow up action|Y|Y|Y|Y|Y|Y|Y|Y|Y|Y|Quarterly||||||||| |Compliance with statutory requirements of relevance to the principles and rectification of any non-compliances6|Y|Y|Y|Y|Y|Y|Y|Y|Y|Y|Quarterly||||||||| |11. \u0007Has the entity carried out independent assessment/ evaluation of the working of its policies by an external agency? (Y/ N). If yes, provide name of the agency.|||||||||||P 1|P 2|P 3|P 4|P 5|P 6|P 7|P 8|P 9| ||||||||||||N|N|N|N|N|N|N|Y (PwC)*|N| |* Price Waterhouse Chartered Accountants, LLP|||||||||||||||||||| 6 \u0007Statutory Compliance Certificate on applicable laws is provided by the Company Secretary and Compliance Officer to the Board of Directors on a quarterly basis. 12 Content ----- |12. \u0007If answer to question (1) above is “No” i.e. not all Principles are covered by a policy, reasons to be stated: Not applicable|Col2|Col3|Col4|Col5|Col6|Col7|Col8|Col9|Col10| |---|---|---|---|---|---|---|---|---|---| |Questions|P 1|P 2|P 3|P 4|P 5|P 6|P 7|P 8|P 9| |The entity does not consider the Principles material to its business (Y/ N)|Not Applicable||||||||| |The entity is not at a stage where it is in a position to formulate and implement the policies on specified principles (Y/ N)|||||||||| |The entity does not have the fni ancial or/ human and technical resources available for the task (Y/ N)|||||||||| |It is planned to be done in the next financial year (Y/ N)|||||||||| |Any other reason|||||||||| Table 1 - Annexure to 1c [under Section B] - Weblinks of the additional Policies aligned to NGRBC Principles |Principle|DLF Policy| |---|---| |P1|Code of Conduct| ||Whistle Blower Policy| ||Supplier Code of Conduct| |P2|Environment Policy| ||Supplier Code of Conduct| |P3|Human Rights Policy| ||Supplier Code of Conduct| |P4|Stakeholder Engagement Policy| |P5|Human Rights Policy| |Principle|DLF Policy| |---|---| |P6|Environment Policy| ||Supplier Code of Conduct| |P7|Code of Conduct| |P8|CSR Policy| ||Stakeholder Engagement Policy| |P9|Customer Satisfaction Policy| ||Code of Conduct| ||Environment Policy| ||Human Rights Policy| Table 2 - Annexure to 4 - National and International standards |Principles|Name of the national and international codes/ certifications/ labels/ standards| |---|---| |P1|Reporting on non-financial indicators aligned to GRI standards.| |P2|ISO 14001:2015 Environment Management System. LEED Platinum Certification in Operation and Maintenance Category from USGBC. LEED Pre-Certification for ‘Platinum’ rating (Core and Shell Development) from USGBC. LEED Zero Water Certification from USGBC. LEED Zero Waste Certification from USGBC for DLF Cybercity - Hyderabad.| |P3|ISO 45001 Occupational Safety Management System. Sword of Honour from the British Safety Council-five-star safety rating system awarded to DLF’s commercial, retail and hospitality properties. WELL Health-Safety Rating for Facility Operations and Management by International WELL Building Institute.| |P4|Materiality assessment and Stakeholder Engagement in line with GRI Standards.| |P5|DLF’s Human Rights Policy is governed by Protection of Human Rights Act, 1993 and guided by international standards and principles, including UN Guiding Principles on Business\n[Source: DLF_13072023190044_BRSR.pdf, ID: DLF_13072023190044_BRSR_9]\nintellectual property related disputes wherein usage of traditional knowledge is involved. |Name of authority|Brief of the Case|Corrective action taken| |---|---|---| |Not Applicable||| 17 Data is provided on the basis of proportion of suppliers covered from the total supplier base (by supplier count). 45 Content ----- DLF ANNUAL REPORT 2022 - 23 Business Responsibility and Sustainability Report 6. Details of beneficiaries of CSR Projects: |S. No.|CSR Project|No. of persons benefitted from CSR Projects|% of beneficiaries from vulnerable and marginalized groups| |---|---|---|---| |1|DLF CARES Education Support Programme.|1,550|100%| |2|Family Health Centre in Gwal Pahari, Gurugram in collaboration with Adharshila Trust providing free healthcare to rural communities.|1,000|100%| |3|Rehabilitation of homeless persons in partnership with Society for Promotion of Youth and Masses (SPYM).|149|100%| |4|Health screening camps organised with Fortis.|517|100%| |5|Healthcare support to persons with disabilities in partnership with Samkalp.|642|100%| |6|Social welfare for inclusive development of children from marginalised communities and children with disabilities in partnership with Vision for Health Welfare and Special Needs (VISHWAS) Vidyalaya.|34|100%| |7|DLF Golf Excellence Programme to support talented and aspiring golfers i.e. young boys and girls through intensive coaching in order to ensure they emerge as leaders in the sport of Golf.|12|N.A.| |8|Ambulance services – DLF Foundation provides 24×7 free ambulance services for general public in multiple locations of Delhi-NCR.|1,690|100%| |9|Support to Gunjan Foundation to provide quality school education to underprivileged children (including provision of school fee, transport, school bags etc.).|179|100%| |10|Affordable healthcare for the poor by providing high end diagnostic equipment including CT Scan machine etc. at the Landour Community Hospital, Mussoorie.|The equipment is used as part of surgical procedures undertaken at the Hospital. serving the population of the area.|100%| |11|Free and subsidised Healthcare facilities provided to stray animals at CGS Hospital’s Pasha Wing.|Animal Beneficiaries Approximately 4,057 OPDs; 497 surgeries; 3,560 vaccines; 2,205 animal cases given radiological diagnostics; 5,837 laboratory tests.|100%| |12|Provided shelter and medical care to animals through a non- profit organization - All Creatures Great and Small (ACGS).|Total Animal Beneficiaries 7,980.|100%| |13|Saving Lives Through Safer Roads project focuses on ensuring pedestrian safety on high traffic roads by constructing safe pedestrian crossovers and corridors, elevator access for differently abled and senior citizens, all-weather tops, foot over bridge, adequate lighting and directional signages.|The project is aimed at general public.|N.A.| |14|Plantation and Greening Projects in Gurugram, Delhi, Noida, Chennai and Hyderabad.|The project is aimed at upgrading the environmental footprint. Total Green Area Developed: 51,558 sq. mtr.; Total trees/ plants planted ~3,77,819.|N.A.| |15|To improve the safety and security of women commuters in streets of Indian cities, DLF Foundation supported Police surveillance of the streets in New Delhi.|The project benefits all women commuters in the identified Project areas.|N.A.| 46 Content ----- PRINCIPLE 9: Businesses should engage with and provide value to their consumers in a responsible manner **Essential Indicators** 1. \u0007Describe the mechanisms in place to receive and respond to consumer complaints and feedback. Customer feedback, questions and complaints are handled in a transparent and timely manner. A dedicated team of qualified Customer Relationship Management (CRM) personnel have been appointed to address each complaint. This mechanism is communicated via the contact no./ e-mail through the\n[Source: DLF_13072023190044_BRSR.pdf, ID: DLF_13072023190044_BRSR_41]\ncybersecurity threat, which include: - Managed Security Services for 24x7 security log monitoring; - Endpoint disk encryption; - Multi-factor authentication for network access; and - Two factor authentication for e-mail access. - Formal training is provided to all the employees at the time of induction, followed by an annual training programme on Information Security Policy guidelines and Data Privacy Protocols at DLF; and - An incident management process exists at DLF for data security related risks, as per which employees can report any incidents/ observations around misuse or improper use of equipment, software or sensitive information for prompt resolution. 48 6. \u0007Provide details of any corrective actions taken or underway on issues relating to advertising and delivery of essential services; cyber security and data privacy of customers; re-occurrence of instances of product recalls; penalty/ action taken by regulatory authorities on safety of products/ services. DLF received complaints related to provision of essential services in DLF’s rental properties such as issues related to provision of electricity, housekeeping and parking allotment. These issues were promptly resolved through corrective actions such as service restoration, repair work etc. **Leadership Indicators** 1. \u0007Channels/ platforms where information on products and services of the entity can be accessed (provide web link, if available). Details of all the products and services are provided on the Company’s website: **https://** **www.dlf.in/ and www.dlf.in/offices** 2. \u0007Steps taken to inform and educate consumers about safe and responsible usage of products and/ or services. Consumers are informed about the safe and responsible usage of DLF’s buildings through various measures undertaken at the time of building handover, as well as during operation and maintenance. - Information on environmental and social parameters associated with the building is provided in the allotment letter which is shared with each customer at the time of handover of residential and commercial property unit(s). For customers of leased assets, such guidelines are covered as part of the lease agreement; - For residential and commercial unit(s) sold by DLF, customers are provided with a user handbook at the time of possession/ handover of the buildings, which carries guidelines on safe and responsible usage of the building, such as fire safety and security, electrical safety, responsible use of appliances and installations in the apartments, measures for preventing accidents and injuries etc.; - For leased properties, FM team generates awareness among customers through e-mail communication and information displayed on the notice board. This includes guidelines related to consumer safety, for instance: - Fire safety advisory formulated by Fire Safety Consultants. Content ----- - Advisory for measures to be undertaken during a natural disaster such as earthquake. - Updates on COVID vaccine availability and administration. - DLF also organizes safety events such as National Safety Week, Fire Service Week, etc. in addition to regular mock drills, in its leased office buildings; and - Furthermore, DLF’s tenant engagement programme includes building/ asset communication, feedback sessions with individual tenants and providing feedback to tenants on efficient energy and water consumption. 3. \u0007Mechanisms in place to inform consumers of any risk of disruption/ discontinuation of essential services. Any risk\n[Source: DLF_13072023190044_BRSR.pdf, ID: DLF_13072023190044_BRSR_43]\n6. \u0007If the entity has undertaken any specific initiatives or used innovative technology or solutions to improve resource efficiency, or reduce impact due to emissions/ effluent discharge/ waste generated, provide details of the same as well as outcome of such initiatives, as per the following format: |S. No.|Initiative undertaken|Details of the initiative (Web-link, if any, may be provided along-with summary)|Outcome of the initiative| |---|---|---|---| |1|Green Energy Solutions|• \u0007DLF promotes the use of renewable sources for energy generation across its real estate portfolio. Rooftop solar plants of capacity 3.5 MW have been installed across DLF’s rental business buildings. • \u0007Wind power is used at commercial buildings to cater to electrical energy requirements. • \u0007Procurement of renewable energy through open-access solar power in retail properties and hydro-power in DLF hotels.|Reduction in GHG emissions| 15 None of DLF’s operations are located around ecologically sensitive areas. 40 Content ----- |S. No.|Initiative undertaken|Details of the initiative (Web-link, if any, may be provided along-with summary)|Outcome of the initiative| |---|---|---|---| |2|Energy Efficiency Measures|Measures undertaken to promote energy efficiency across the portfolio including: • Use of energy efficient equipment such as LED lights, motion sensors, high efficiency HVAC systems, replacement of refrigerant units with R22 gas with energy efficient R134A gas, hydro-pneumatic pumps with VFD; • Automatic tube cleaning system installed in chillers to conserve energy and reduce GHG emissions; • Smart grid/ smart building technologies installed in properties; and • Wall and roof insulation.|Improved energy efficiency and reduced GHG emissions| |3|Water Efficiency Measures|Measures undertaken to promote water efficiency across the portfolio including: • Sensor based and high efficiency fixtures used for urinals and taps in wash basins, as well as waterless urinals in common areas of commercial properties; • Low flow taps and faucets with aerators to reduce the flow rate by 50-60%; • Pressure Reducing Valve (PRV) settings of 1.5–2 kg/ cm2; • Aerator for a maximum fol w of 2.8 litres per minute and 6 litres per minute installed in wash basin taps and pantry taps, respectively; and • To improve the efficiency of STP, high-efficiency volute systems have been installed in place of traditional sludge dewatering systems such as filter press and centrifuge.|Improved water use efficiency and water conservation| |4|Air Quality Improvement Measures|• HEPA filter-based air purification systems installed in DLF Malls (retail properties) to enhance indoor air quality and reduce pollution; • Air quality improvement through installation of Merv 14 filters for all AHUs and fresh air circulation from 1 ACPH to 2 ACPH in office spaces (commercial properties); • Use of anti-smog guns at construction sites to reduce air pollution; and • Construction of wheel wash bay to control dust from vehicles exiting the construction site.|Indoor air quality improvement and reduction in air pollution through construction activities| |5|Waste Management|• Installation of OWC at its managed sites to recycle organic waste into nutrient-rich compost, which is then used for horticultural purposes.|Waste reduction| |6|LEED Certifications|• DLF’s Rental business, achieved ‘LEED Zero Water’ certification for properties including DLF Cybercity, Gurugram and DLF Cybercity, Chennai, from the USGBC, by achieving a potable water use balance of zero. Five\n[Source: DLF_13072023190044_BRSR.pdf, ID: DLF_13072023190044_BRSR_36]\n|75|DLF Lands India Private Limited|Subsidiary|66.66|| |76|DLF Assets Limited|Subsidiary|66.66|| |77|DLF City Centre Limited|Subsidiary|66.66|| |78|DLF Cyber City Developers Limited|Subsidiary|66.66|| |79|DLF Emporio Limited|Subsidiary|66.66|| |80|DLF Info City Developers (Chandigarh) Limited|Subsidiary|66.66|| |81|DLF Info City Developers (Kolkata) Limited|Subsidiary|66.66|| |82|DLF Info Park Developers (Chennai) Limited|Subsidiary|66.66|| |83|DLF Power & Services Limited|Subsidiary|66.66|| |84|DLF Promenade Limited|Subsidiary|66.66|| |85|Nambi Buildwell Limited|Subsidiary|66.66|| |86|Paliwal Real Estate Limited|Subsidiary|66.66|| |87|DLF Info City Chennai Limited|Subsidiary|66.66|| |88|Fairleaf Real Estate Private Limited|Subsidiary|66.66|| |89|Atrium Place Developers Private Limited (formerly Aadarshini Real Estate Developers Private Limited)|Subsidiary|67.00|| 5 Content ----- DLF ANNUAL REPORT 2022 - 23 Business Responsibility and Sustainability Report |S. No.|Name of the holding/ subsidiary/ associate companies/ joint ventures (A)|Indicate whether Holding/ Subsidiary/ Associate/ Joint Venture|% of shares held by listed entity|Does the entity indicated at column A, participate in the Business Responsibility initiatives of the listed entity? (Y/ N)| |---|---|---|---|---| |90|DLF Midtown Private Limited|Subsidiary|50.00|| |91|DLF Urban Private Limited|Subsidiary|50.00|| |92|Jesen Builders & Developers Private Limited|Subsidiary|100.00|| |93|Jingle Builders & Developers Private Limited|Subsidiary|100.00|| |94|Gavel Builders & Constructions Private Limited|Subsidiary|100.00|| |95|Keyna Builders & Constructions Private Limited|Subsidiary|100.00|| |96|Morgan Builders & Developers Private Limited|Subsidiary|100.00|| |97|Morina Builders & Developers Private Limited|Subsidiary|100.00|| |98|Morven Builders & Developers Private Limited|Subsidiary|100.00|| |99|DLF Golf Resorts Limited|Subsidiary|100.00|| |100|DLF Homes Services Private Limited|Subsidiary|100.00|| |101|Amon Estates Private Limited|Subsidiary|100.00|| |102|Calista Real Estates Private Limited|Subsidiary|100.00|| |103|Hestia Realtors Private Limited|Subsidiary|100.00|| |104|Chevalier Builders & Constructions Private Limited|Subsidiary|100.00|| |105|Erasma Builders & Developers Private Limited|Subsidiary|100.00|| |106|Laraine Builders & Constructions Private Limited|Subsidiary|100.00|| |107|Snigdha Builders & Constructions Private Limited|Subsidiary|100.00|| |108|Alankrit Estates Limited*|Subsidiary|0.02|| |109|Kirtimaan Builders Limited*|Subsidiary|0.00|| |110|Ujagar Estates Limited*|Subsidiary|0.11|| |111|DLF Estate Developers Limited|Subsidiary|100.00|| |112|Tiberias Developers Limited|Subsidiary|100.00|| |113|DLF IT Offices Chennai Private Limited|Subsidiary|100.00|| |114|DLF Garden City Indore Private Limited|Subsidiary|100.00|| |115|DLF Residential Developers Limited|Subsidiary|100.00|| |116|Latona Builders & Constructions Private Limited|Subsidiary|100.00|| |117|Livana Builders & Developers Private Limited|Subsidiary|100.00|| |118|Chamundeswari Builders Private Limited|Subsidiary|100.00|| |119|Bhamini Real Estate Developers Private Limited|Subsidiary|100.00|| - Refer statement containing salient features of the financial statements of subsidiaries, associate companies and joint ventures as at 31 March 2023 forming part of the Annual Report. 6 Content ----- |S. No.|Name of the holding/ subsidiary/ associate companies/ joint ventures (A)|Indicate whether Holding/ Subsidiary/ Associate/ Joint Venture|% of shares held by listed entity|Does the entity indicated at column A, participate in the Business Responsibility initiatives of the listed entity? (Y/ N)| |---|---|---|---|---| |120|Chandrajyoti Estate Developers Private Limited|Subsidiary|100.00|| |121|DLF Exclusive Floors Private Limited (formerly Delanco Home and Resorts Private Limited)|Subsidiary|100.00|| |122|Nellis Builders & Developers Private Limited|Subsidiary|100.00|| |123|Rochelle Builders & Constructions Private Limited|Subsidiary|100.00|| |124|Urvasi Infratech Private Limited|Subsidiary|100.00|| |125|Oriel Real Estates Private Limited|Subsidiary|100.00|| |126|Afaaf Builders & Developers Private Limited|Subsidiary|100.00|| |127|Aaralyn Builders & Developers Private Limited|Subsidiary|100.00|| |128|Akina Builders & Developers Private Limited|Subsidiary|100.00|| |129|Arlie Builders & Developers Private Limited|Subsidiary|100.00|| |130|Cadence Real Estates Private Limited|Subsidiary|100.00|| |131|Hoshi Builders & Developers Private Limited|Subsidiary|100.00|| |132|Jayanti Real Estate Developers Private Limited|Subsidiary|100.00|| |133|Naja Builders & Developers Private Limited|Subsidiary|100.00|| |134|Ophira Builders & Developers Private Limited|Subsidiary|100.00|| |135|Qabil Builders & Developers Private Limited|Subsidiary|100.00|| |136|Sagardutt Builders & Developers Private Limited|Subsidiary|100.00|| |137|Unicorn Real Estate Developers Private Limited|Subsidiary|100.00|| |138|Vamil Builders & Developers Private Limited|Subsidiary|100.00|| |139|Zanobi Builders & Constructions Private Limited|Subsidiary|100.00|| |140|Tane Estates Private Limited|Subsidiary|100.00|| |141|Arizona Globalservices Private Limited|Associate|48.94|No| |142|Designplus Associates Services Private Limited|Associate|42.49|| |143|DLF SBPL Developers Private Limited|Associate|50.00|| |144|Joyous Housing Limited|Associate|37.50|| **VI. CSR Details** **22. (i) Whether CSR is applicable as per section 135 of Companies Act,\n[Source: DLF_13072023190044_BRSR.pdf, ID: DLF_13072023190044_BRSR_3]"
}